#--------------------------------- “≈—“ --------------------------------
from tabledifffun import *
prev_table = [
    ['A', 1, 100, '=B1+10'],
    ['B', 1, 90, ''],
    ['C', 1, 200, '=A1+1'],
    ['E', 1, 3, '=A1*4']]

curr_table = [
    ['A', 1, 150, '=B1+10'],  #изменилось значение
    ['B', 1, 91, '=A1-50'],   #изменилось значение и формула
    #€чейка ['C', 1, 200, '=A1+1'] удалена
    ['D', 1, 50, '=A1+B1'],   #нова€ €чейка
    #€чейка ['E', 1, 3, '=A1*4'] удалена
    ['F', 3, 50, '=A1+B1'],   #нова€ €чейка
    ['G', 2, 1, '']]          #нова€ €чейка

print("********************** JSON-data **********************")
diff1 = tables_differences(prev_table, curr_table, switch=False)
print("\n============================================================================\n")
print("********************** All data **********************")
diff2 = tables_differences(prev_table, curr_table, switch=True)